# Pandas Demo

In [1]:
import pandas as pd
import random

In [2]:
pd.Series([1,2,3,4,5,6,7])
rannos = pd.Series(random.randint(0,100) for i in range (20))
rannos[rannos < 50]**2

0     1156
1       36
2     1156
4     1156
6      441
9     1936
12     484
14     361
15    1681
17     441
19    1764
dtype: int64

In [3]:
rannos.describe()

count    20.000000
mean     49.050000
std      27.172887
min       6.000000
25%      31.000000
50%      43.000000
75%      63.000000
max      98.000000
dtype: float64

In [4]:
rannos.abs()

0     34
1      6
2     34
3     59
4     34
5     75
6     21
7     55
8     87
9     44
10    50
11    59
12    22
13    95
14    19
15    41
16    98
17    21
18    85
19    42
dtype: int64

In [5]:
states_dict = {
    "states": ["New York", "California", "Texas", "Florida", "New Jersey", "Washington"],
    "capital": ["New York City", "Sacramento", "Austin", "Tallahassee", "Trenton", "Olympia"],
    "population": [19750000, 38800000, 26960000, 19890000, 8938000, 7062000]
}

In [6]:
states_df = pd.DataFrame(states_dict)
states_df.population

0    19750000
1    38800000
2    26960000
3    19890000
4     8938000
5     7062000
Name: population, dtype: int64

In [7]:
states_df[["states", "capital"]]

       states        capital
0    New York  New York City
1  California     Sacramento
2       Texas         Austin
3     Florida    Tallahassee
4  New Jersey        Trenton
5  Washington        Olympia

In [8]:
states_df.loc[3]

capital       Tallahassee
population       19890000
states            Florida
Name: 3, dtype: object

## Select Multiple columns

In [9]:
states_df.loc[[0, 2, 4]]

         capital  population      states
0  New York City    19750000    New York
2         Austin    26960000       Texas
4        Trenton     8938000  New Jersey

In [10]:
states_df.set_index("states")
states_df.set_index("states", inplace=True) # inplace=True muteates the original dataframe

In [11]:
states_df

                  capital  population
states
New York    New York City    19750000
California     Sacramento    38800000
Texas              Austin    26960000
Florida       Tallahassee    19890000
New Jersey        Trenton     8938000
Washington        Olympia     7062000

In [12]:
states_df['capital'].loc["New York"] = "Albany"

/home/banksd/Documents/Projects/501-data-analysis/lib/python3.5/site-packages/pandas/core/indexing.py:140: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [13]:
states_df

                capital  population
states
New York         Albany    19750000
California   Sacramento    38800000
Texas            Austin    26960000
Florida     Tallahassee    19890000
New Jersey      Trenton     8938000
Washington      Olympia     7062000

In [14]:
states_df["capital"].loc["New York": "Texas"]

states
New York          Albany
California    Sacramento
Texas             Austin
Name: capital, dtype: object

In [15]:
# states_df.reset_index(inplace=True)
states_df

                capital  population
states
New York         Albany    19750000
California   Sacramento    38800000
Texas            Austin    26960000
Florida     Tallahassee    19890000
New Jersey      Trenton     8938000
Washington      Olympia     7062000

In [16]:
states_df.describe()

         population
count  6.000000e+00
mean   2.023333e+07
std    1.175916e+07
min    7.062000e+06
25%    1.164100e+07
50%    1.982000e+07
75%    2.519250e+07
max    3.880000e+07

In [19]:
states_df.rename(index={
        "New York": "NY",
        "California": "CA",
        "Texas": "TX",
        "Florida": "FL",
        "New Jersey": "NJ",
        "Washington": "WA"
    }, columns={"capital": "capital city", })

       capital city  population
states
NY           Albany    19750000
CA       Sacramento    38800000
TX           Austin    26960000
FL      Tallahassee    19890000
NJ          Trenton     8938000
WA          Olympia     7062000

## Add new Column

In [20]:
states_df["time zone"] = ["EST", "PST", "CST", "EST", "EST", "PST"]

In [21]:
states_df

                capital  population time zone
states
New York         Albany    19750000       EST
California   Sacramento    38800000       PST
Texas            Austin    26960000       CST
Florida     Tallahassee    19890000       EST
New Jersey      Trenton     8938000       EST
Washington      Olympia     7062000       PST

In [22]:
states_df["pop per mil"] = states_df.population / 1E6

In [24]:
states_df

                capital  population time zone  pop per mil
states
New York         Albany    19750000       EST       19.750
California   Sacramento    38800000       PST       38.800
Texas            Austin    26960000       CST       26.960
Florida     Tallahassee    19890000       EST       19.890
New Jersey      Trenton     8938000       EST        8.938
Washington      Olympia     7062000       PST        7.062

## Making a New Row

In [30]:
new_row = {"capital": ["Springfield"],
           "population": [200000000],
           "time zone": ["CST"],
           "pop per mil": [200],
           "states": ["IL"]}
pd.concat([states_df, pd.DataFrame(new_row)]).set_index("states")

            capital  pop per mil  population time zone
states
NaN          Albany       19.750    19750000       EST
NaN      Sacramento       38.800    38800000       PST
NaN          Austin       26.960    26960000       CST
NaN     Tallahassee       19.890    19890000       EST
NaN         Trenton        8.938     8938000       EST
NaN         Olympia        7.062     7062000       PST
IL      Springfield      200.000   200000000       CST

## Detour for PandaSQL

In [32]:
import pandasql as sql
sql.sqldf("SELECT population FROM states_df", locals())

   population
0    19750000
1    38800000
2    26960000
3    19890000
4     8938000
5     7062000

## Reading a CSV file

In [33]:
uber = pd.read_csv("data/Uber-Jan-Feb-FOIL.csv")

In [39]:
uber.date = pd.to_datetime(uber.date)

In [40]:
uber

    dispatching_base_number       date  active_vehicles  trips
0                    B02512 2015-01-01              190   1132
1                    B02765 2015-01-01              225   1765
2                    B02764 2015-01-01             3427  29421
3                    B02682 2015-01-01              945   7679
4                    B02617 2015-01-01             1228   9537
5                    B02598 2015-01-01              870   6903
6                    B02598 2015-01-02              785   4768
7                    B02617 2015-01-02             1137   7065
8                    B02512 2015-01-02              175    875
9                    B02682 2015-01-02              890   5506
10                   B02765 2015-01-02              196   1001
11                   B02764 2015-01-02             3147  19974
12                   B02765 2015-01-03              201   1526
13                   B02617 2015-01-03             1188  10664
14                   B02598 2015-01-03              818   7432
15                   B02682 2015-01-03              915   8010
16                   B02512 2015-01-03              173   1088
17                   B02764 2015-01-03             3215  29729
18                   B02512 2015-01-04              147    791
19                   B02682 2015-01-04              812   5621
20                   B02598 2015-01-04              746   5223
21                   B02765 2015-01-04              183    993
22                   B02617 2015-01-04             1088   7729
23                   B02764 2015-01-04             2862  20441
24                   B02512 2015-01-05              194    984
25                   B02682 2015-01-05              951   6012
26                   B02617 2015-01-05             1218   7899
27                   B02764 2015-01-05             3387  20926
28                   B02598 2015-01-05              907   5798
29                   B02765 2015-01-05              227   1133
..                      ...        ...              ...    ...
324                  B02764 2015-02-24             3965  34686
325                  B02512 2015-02-24              247   1869
326                  B02598 2015-02-24             1061   9954
327                  B02682 2015-02-24             1346  12497
328                  B02617 2015-02-24             1456  13719
329                  B02765 2015-02-24              698   6390
330                  B02512 2015-02-25              246   1647
331                  B02598 2015-02-25             1076   9405
332                  B02765 2015-02-25              706   6178
333                  B02682 2015-02-25             1395  12693
334                  B02617 2015-02-25             1473  12811
335                  B02764 2015-02-25             3934  31957
336                  B02598 2015-02-26             1134  10661
337                  B02617 2015-02-26             1539  14461
338                  B02682 2015-02-26             1465  13814
339                  B02512 2015-02-26              243   1797
340                  B02765 2015-02-26              745   6744
341                  B02764 2015-02-26             4101  36091
342                  B02765 2015-02-27              786   7563
343                  B02617 2015-02-27             1551  14677
344                  B02598 2015-02-27             1114  10755
345                  B02512 2015-02-27              272   2056
346                  B02764 2015-02-27             4253  38780
347                  B02682 2015-02-27             1510  14975
348                  B02598 2015-02-28              994  10319
349                  B02764 2015-02-28             3952  39812
350                  B02617 2015-02-28             1372  14022
351                  B02682 2015-02-28             1386  14472
352                  B02512 2015-02-28              230   1803
353                  B02765 2015-02-28              747   7753

[354 rows x 4 columns]

## Writing to a JSON file

In [41]:
uber.to_json("sample.json")

## Writing to CSV file

In [44]:
uber.to_csv("sample.csv", index=False, header=False)